Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: སྨྲས་པ། གཟུགས་མི་སྐྱེ་བར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ནི་མི་སྐྱེ་བ་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། །
en: “Reaching acceptance of the unborn nature of form is known as reaching acceptance of the unborn nature.

source: དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་སྐྱེ་བར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ནི་མི་སྐྱེ་བ་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Likewise, reaching acceptance of the unborn nature of feeling, of perception, of formation, and of consciousness is known as reaching acceptance of the unborn nature.

source: ཆོས་ཐམས་ཅད་ཀྱི་བར་དུ་མི་སྐྱེ་བར་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ནི་མི་སྐྱེ་བ་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Reaching acceptance of the unborn nature of all phenomena is known as reaching acceptance of the unborn nature.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བ་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་དེས་བཟོད་པ་རབ་ཏུ་འཐོབ་སྟེ། དེ་ནི་ཀུན་ཏུ་འགྲོ་བ་ཞེས་བྱའོ། །
en: “Furthermore, lord of nāgas, bodhisattvas who reach acceptance of the unborn nature of phenomena fully achieve patience, which is known as the all-pervasive.

source: དེ་རབ་ཏུ་ཐོབ་པས་སེམས་ཅན་ཐམས་ཅད་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: In obtaining it, bodhisattvas correctly observe all beings as the attainment of patience itself.

source: ཀུན་ཏུ་འགྲོ་བ་ཡང་མི་སྐྱེ་བ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: And they correctly observe the all-pervasive as the unborn nature itself.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་ངོ་བོ་ཉིད་དུ་མེད་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They correctly observe that all beings are without an essential nature.

source: སེམས་ཅན་ཐམས་ཅད་མ་སྐྱེས་པ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They correctly observe that all beings are unborn.

source: སེམས་ཅན་ཐམས་ཅད་དེའི་མཚན་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They correctly observe it as being the characteristic of all beings.

source: མཉམ་པ་ཉིད་ལས་གཞན་ཆོས་ཕྲ་རབ་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: And, correctly, they do not observe even the tiniest particle that is other than sameness.

source: བཟོད་པ་དེ་ཡང་སྐད་ཅིག་པའོ། །
en: “That patience is momentary.

source: ཅིས་སྐད་ཅིག་པ་ཞེ་ན། མིག་དང་།
en: How is it momentary?

source: གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ནས་ཡིད་དང་། ཆོས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་བར་གྱིས་སོ། །ཇི་ལྟར་མིག་ལ་སོགས་པ་སྐད་ཅིག་པ་དེ་བཞིན་དུ་སྔོན་གྱི་མཐའི་བཟོད་པ་ཡང་སྐད་ཅིག་པ།
en: From the eye, form, and eye consciousness up through the mind, mental phenomena, and mental consciousness, just as the eye and so forth are momentary, so, too, is acceptance of all of the past momentary, and so are acceptance of all of the future and of the present momentary.

source: ཕྱི་མའི་མཐའ་དང་ད་ལྟར་བྱུང་བའི་བཟོད་པ་ཡང་སྐད་ཅིག་པའོ། །ཇི་ལྟར་དུས་གསུམ་གྱིས་བཟོད་པ་སྐད་ཅིག་པ་དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྐད་ཅིག་པའོ། །
en: Just as acceptance of the three times is momentary, so, too, are all beings are momentary.

source: ཅིས་སྐད་ཅིག་པ་ཞེ་ན།
en: How are they momentary?

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་སྐད་ཅིག་པའོ། །
en: The afflictions of desire, aversion, and delusion are momentary.

source: ཇི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སྐད་ཅིག་པ་དེ་ལྟར་ཕྱིན་ཅི་ལོག་གིས་ཉོན་མོངས་པ་སྐྱེ་བ་གང་ཡིན་པ་དེ་དག་ཀྱང་སྐད་ཅིག་པའོ། །
en: Just as all beings are momentary, so, too, are the afflictions that arise from mistaken views momentary.

source: དེ་ལྟར་ཡེ་ཤེས་དང་ལྡན་པ་མི་སྐྱེ་བ་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་གྲོལ་ལ་ཉེ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: In this way, a bodhisattva who has wisdom, who has reached acceptance of the unborn, correctly sees all beings as liberated.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གི་ཉོན་མོངས་པ་ཇི་ལྟར་སྐད་ཅིག་པ་དང་། ཇི་ལྟར་གསོག་ཡིན་པ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཡང་དེ་ལྟར་སྐད་ཅིག་པའོ། །དེ་ལྟར་གསོག་གོ། །
en: That bodhisattva thinks, ‘Just as my own afflictions are momentary and unreal, the afflictions of all beings are momentary and unreal.

source: རྣམ་པར་གྲོལ་བ་ལ་ནི་ཉོན་མོངས་པ་དེ་དག་གི་རྩ་བ་མེད་དོ། །སྟོབས་མེད་དོ། །
en: Liberation is beyond the roots of those afflictions and beyond their power.

source: གལ་ཏེ་དེ་དག་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་མ་ཡིན་ན་ནི་སུ་ཡང་མྱ་ངན་ལས་འདའ་བར་མི་འགྱུར་བ་ཞིག་ན།
en: If they are not liberated, then no one would pass beyond suffering.

source: གང་གི་ཕྱིར་དེ་དག་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ་དེའི་ཕྱིར་དེ་དག་རྣམ་པར་གྲོལ་བའི་ངོ་བོ་ཉིད་དུ་གནས་སོ། །
en: Therefore, they are liberated and abide in the essential nature of liberation.’

source: དེ་ལྟར་ཡེ་ཤེས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ལ་སྐྱོ་བ་མེད་དོ། །
en: This is how bodhisattvas with wisdom do not become disheartened while bringing beings to maturity.

source: ཆོས་ཐམས་ཅད་བཅིངས་པ་མེད་པས་རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བའི་ཕྱིར་རོ། །
en: Because they correctly see that since all phenomena are unbound, they are intrinsically liberated.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སེམས་ཅན་འདི་དག་ནི་རང་བཞིན་གྱིས་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་ལ།
en: They think, ‘These beings are completely, naturally unafflicted.

source: རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བ་མ་ཡིན་ན་སྒྲོ་བཏགས་པའི་ཉོན་མོངས་པས་ཀུན་ནས་ཉོན་མོངས་སོ། །
en: If they were not intrinsically liberated, they would be afflicted by imputed afflictions.

source: སེམས་ཅན་འདི་དག་ནི་རང་བཞིན་གྱིས་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་ལ་རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བ་ཡིན་ན་ཡང་དག་པ་མ་ཡིན་པ་ཡོངས་སུ་རྟོག་པས་ཀུན་ནས་ཉོན་མོངས་སོ། །
en: These beings are completely, naturally unafflicted. If they were not intrinsically liberated, they would be afflicted by inauthentic concepts.

source: སེམས་ཅན་འདི་དག་ནི་རང་བཞིན་གྱིས་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་ལ་རང་བཞིན་གྱིས་རྣམ་པར་གྲོལ་བ་ཡིན་ན། འདུ་ཤེས་དང་། སེམས་དང་།
en: These beings are completely, naturally unafflicted.

source: ཡིད་ལ་བྱེད་པས་ཀུན་ནས་ཉོན་མོངས་སོ། །
en: If they were not intrinsically liberated, they would be afflicted by perception, the mind, and conceptual activity.’

source: ཀླུའི་བདག་པོ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་ཀྱི་ཡུལ་ཡང་མཐོབ།
en: “Lord of nāgas, bodhisattvas who have reached acceptance of the unborn nature of phenomena reach the domain of the buddhas.

source: སོ་སོའི་སྐྱེ་བོ་དང་། སློབ་པ་དང་། མི་སློབ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ཡང་མི་གནས།
en: They do not abide in the domains of ordinary beings, nor of those who are in training, of those who are no longer training, or of solitary buddhas.

source: ཡུལ་ཐམས་ཅད་ཀྱང་སྤོང་།
en: They have abandoned all domains.

source: ཡུལ་ལ་འདོད་ཆགས་ཀྱིས་ཆགས་པའང་མེད།
en: They are not driven by attachment toward any domain.

source: ཡུལ་ལ་ཞེ་སྡང་གིས་སྡང་བ་ཡང་མེད།
en: They are not driven by aversion toward any domain.

source: ཡུལ་ལ་གཏི་མུག་གིས་རྨོངས་པ་ཡང་མེད་དོ། །ཡུལ་ལ་འདོད་ཆགས་དང་བྲལ་བ་ཐོབ་པ་ཡང་མ་ཡིན་ལ། འདོད་ཆགས་དང་བྲལ་བའི་མཐའ་ལ་ཡང་གནས་ཤིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རང་གི་ཡུལ་ལ་ཉོན་མོངས་པ་མེད་པར་ལོངས་སྤྱོད་པའི་ཕྱིར་ཡུལ་ཐམས་ཅད་ཀྱང་མི་སྤོང་ངོ་། །
en: They are not confused by delusion concerning any domain, nor have they reached being without attachment to any domain—they abide in the extent of being free of attachment, yet in order to bring beings to maturity, they do not reject any domains, and they experience their domains without affliction.

source: དེ་བདུད་ཀྱི་ཡུལ་ལ་ཡང་རྒྱུ་ཞིང་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཀྱང་མི་འདོར་རོ། །
en: They roam within the domains of Māra, yet they do not discard the characteristic of the essential nature of the buddhas’ domain.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཡུལ་ཡང་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་ལ་སེམས་ཅན་གྱི་ཁམས་ཀྱི་ཡུལ་ལ་ཡང་གནས་སོ། །
en: They do not disturb the domain of the realm of phenomena, yet they abide in the domain of the realm of beings.

source: ཆོས་ཐམས་ཅད་ཡུལ་མེད་ཅིང་ཡུལ་དང་བྲལ་བར་ཡང་རབ་ཏུ་ཤེས་ཤིང་ལས་ཀྱི་ཡུལ་ལ་ཡང་འཇུག་གོ། །
en: They understand that all phenomena are devoid of an object and are beyond domains, yet they engage in the realm of activity.

source: ཤེས་རབ་ཀྱིས་ལས་མེད་ཅིང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་པར་ཡང་སོ་སོར་རྟོག་ལ་མངོན་པར་འདུ་བྱེད་པའི་ཡུལ་ལ་ཡང་མངོན་པར་འདུ་བྱེད་དོ། །
en: Through their insight, they understand that there are neither actions nor any fruition of actions, yet they engage in formation in the realm of formation.

source: མངོན་པར་འདུ་མི་བྱེད་པའི་ཡུལ་ལ་ཡང་མི་འཇུག་ལ་བཏང་སྙོམས་པ་ཡང་མ་ཡིན་ནོ། །
en: They do not enter the realm of nonformation, nor are they indifferent.

source: དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་མ་སྐྱེས་པར་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་ལ། འཕགས་པའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ཡང་མ་ཡིན་ནོ། །
en: They create virtue and correctly see that all phenomena are unborn, but they do not enter the flawless state of the noble ones.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པའི་སྐྱོན་མེད་པ་ལ་མི་འཇུག་ཅེས་དེ་སྐད་སྨྲ་ན། བྱང་ཆུབ་སེམས་དཔའ་སྐྱོན་མེད་པ་ལ་འཇུག་པ་གང་ཡིན།
en: Then the nāga king Anavatapta asked Mañjuśrīkumārabhūta, “Mañjuśrī, when you say that bodhisattvas do not enter the flawless state of the noble ones, what is the entrance into flawlessness for bodhisattvas?”

source: སྨྲས་པ། ཀླུའི་བདག་པོ་ཕྱིར་མི་ལྡོག་པ་ལ་འཇུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྐྱོན་མེད་པ་ལ་འཇུག་པའོ། །
en: “Lord of nāgas, bodhisattvas at the stage of irreversibility enter flawlessness.

source: ཀླུའི་བདག་པོ་ཡིད་ལ་བྱེད་པ་ཐམས་ཅད་ལ་ངའི་བ་མེད་པར་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་ཤེས་ཀྱང་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པར་ཞུགས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བརྩོན་འགྲུས་རྩོམ་མོ། །སྨྲས་པ།
en: Lord of nāgas, bodhisattvas understand that the entirety of mental activity is devoid of ‘mine,’ yet they still endeavor for the sake of beings who cling to ‘I’ and ‘mine.’ ”

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་གང་ལས་རྣམ་པར་གྲོལ་ཏེ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པས་བཅིངས་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་སྐྱེད་པ་གང་ཡིན། སྨྲས་པ།
en: “Mañjuśrī, what is the compassion that bodhisattvas who are free from clinging to ‘I’ and ‘mine’ generate for beings who are still bound by such clinging?”

source: ཕུང་པོ་ལྔར་སྒྲོ་བཏགས་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་རབ་ཏུ་ཤེས་ཤིང་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱིས་རློམ་སེམས་སུ་ཡང་མི་བྱེད་ལ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བསམས་བཞིན་དུ་སྲིད་པའང་ལེན་ཏེ།
en: “Bodhisattvas who abide in the five aggregates as imputations, who understand clinging to ‘I’ and clinging to ‘mine,’ and who are not taken in by the aggregates and elements and sense sources nevertheless accept their existence for the sake of those beings who live through the aggregates, elements and sense sources.

source: དེ་སྐྱེ་ལ་འདུ་བྱེད་ཐམས་ཅད་མི་སྐྱེ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་། སྐྱེ་བ་དང་། མི་སྐྱེ་བའི་ཕྱིར་སྐྱེ་བ་དང་། མི་སྐྱེ་བ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །
en: They correctly see that arising as the unborn nature of all compounded phenomena, and they correctly see all that is born and unborn as born and unborn.

source: ཀླུའི་བདག་པོ་ཤེས་རབ་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་སྟེ། ཐབས་ཀྱིས་ཀྱང་ཞུགས་པས་སྲིད་པར་འགྲོ་བ་རྣམས་སུ་ཀུན་ཏུ་སྣང་ངོ་། །
en: “Lord of nāgas, bodhisattvas enter flawlessness through insight, but since they also manifest skillful means, they appear to all those who wander in saṃsāra.

source: ཀླུའི་བདག་པོ་སྟོང་པ་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་སྟེ། ཐབས་ཀྱིས་ཀྱང་ཞུགས་པས་ལྟ་བར་ལྷུང་བའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དོ། །
en: Lord of nāgas, emptiness is the entrance to the flawlessness of bodhisattvas, but since they also manifest skillful means, they generate great compassion for those beings who adhere to mistaken views.

source: མཚན་མ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་སྟེ། ཐབས་ཀྱིས་ཀྱང་ཞུགས་པས་རྣམ་པར་རྟོག་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དོ། །
en: Signlessness is the entrance into the flawless state of the bodhisattvas, but since they also manifest skillful means, they generate great compassion for those who indulge in conceptual thinking.

source: སྨོན་པ་མེད་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་སྟེ། ཐབས་ཀྱིས་ཀྱང་ཞུགས་པས་སྨོན་ལམ་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་དོ། །
en: Wishlessness is the entrance into the flawlessness of bodhisattvas, but since they also manifest skillful means, they generate great compassion for those who form wishes.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་བདག་མེད་པའི་ཆོས་ལ་ཡང་འཇུག་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱང་མི་རྟག་པ་ཉིད་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པ་ལ་ཡང་འཇུག་ལ་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱང་མི་བརྗེད་པ་དང་།
en: “Lord of nāgas, bodhisattvas understand that phenomena are without self and that beings are impermanent, devoid of life force, and devoid of personhood, yet they do not forget the intent to reach awakening.

source: འདུས་མ་བྱས་པའི་ཆོས་ལ་ཡང་འཇུག་ལ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་དགེ་བའི་རྩ་བ་ཡང་སོགས་པ་དང་།
en: They understand that phenomena are uncompounded, yet they still accumulate the roots of virtue that mature as the thirty-two major marks of a great being.

source: ཤིན་ཏུ་ཞི་ཞིང་ཉེ་བར་ཡང་ཞི་ལ་མ་རིག་པ་ཤིན་ཏུ་མ་ཞི་ཞིང་ཉེ་བར་ཞི་བ་ཡང་མ་ཞི་བ་དང་། བག་ལ་ཉལ་ཡང་དག་པར་འཇོམས་ལ་སྔོན་གྱི་དམ་བཅས་པ་ཡང་མི་འདོར་བ་དང་། སེམས་དང་། ཡིད་དང་། རྣམ་པར་ཤེས་པ་དང་ཡང་བྲལ་ལ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ལ་ཡང་མཉམ་པར་གཞག་པ་དང་།
en: They are utterly calm and at peace, yet they do not abandon their previous commitment to conquer ignorance—the lack of calm and peace—and latent tendencies and to settle their mind, mental faculty, and consciousness evenly in the mind of omniscience.

source: ང་རྒྱལ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་འཇོམས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྟོགས་པ་ལ་ཡང་མཁས་པ་དང་།
en: They have conquered all forms of pride and are expert in discerning the faculties of all beings.

source: འཕགས་པའི་ཡོན་ཏན་ཡང་བརྗོད་ལ་འཕགས་པ་མ་ཡིན་པའི་ཆོས་ལ་གནས་པར་ཡང་བརྩོན་པ་དང་།
en: They proclaim the qualities of the noble ones yet diligently remain in the midst of ignoble phenomena.

source: སྤྲོས་པ་ཡང་མེད་ལ་སྤྲོས་པ་ལ་ཡང་འཇུག་པ་དང་།
en: They have no mental constructs, yet they engage with mental constructs.

source: ཉེ་བར་ཡང་ཞི་ལ་ཉེ་བར་མ་ཞི་བ་ཡང་ཡོངས་སུ་འཛིན་པ་དང་།
en: They are utterly at peace, yet they support those who are not at peace.

source: མི་གཡོ་ཞིང་རྣམ་པར་མི་གཡོ་བ་ཡང་རྒྱུན་མི་གཅོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་རྣམ་པར་བསྒྲུབ་པར་ཡང་ཉེ་བར་གནས་པ་ནི་ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་འཇིག་རྟེན་ལས་འདས་པ་སྟེ།
en: They are constantly unwavering and immovable, yet they still accomplish the ornaments of the buddha fields.

source: འཇིག་རྟེན་ལས་ལྡོག་པ་ཡང་མ་ཡིན་པའོ། །
en: Lord of nāgas, this flawlessness of bodhisattvas transcends the world but does not turn away from it.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་གང་ཤེས་རབ་དང་། ཐབས་དང་ལྡན་པ་དང་འཕགས་པའི་ཏིང་ངེ་འཛིན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པའོ། །
en: Lord of nāgas, this noble absorption of being endowed with insight and skillful means in this way is the entrance into the flawlessness of bodhisattvas.

source: ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ནི་ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཏེ་རྒྱུན་དུ་ཞུགས་པ་ཞེས་བྱའོ། །
en: “For example, lord of nāgas, when it comes to the entrance into the flawlessness of hearers, the quality of not falling into errors is known as entering the stream.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ནི་ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཏེ་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ། །
en: Similarly, lord of nāgas, when it comes to the entrance into the flawlessness of bodhisattvas, the quality of not falling into errors is known as irreversibility.

source: ཀླུའི་བདག་པོ་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ནི་མི་འདའ་བ་སྟེ། གདོན་མི་ཟ་བར་འབྲས་བུ་ཐོབ་པར་བྱེད་པའོ། །
en: Lord of nāgas, the entrance into the flawlessness of hearers is not transcendent, although it leads with certainty to the attainment of fruition.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ནི་འདའ་བ་སྟེ།
en: The entrance into the flawlessness of bodhisattvas is transcendent.

source: ཉན་ཐོས་ཀྱི་འབྲས་བུ་ཐོབ་པར་མི་བྱེད་ཀྱི་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་འབྲས་བུ་དང་ཉེ་བར་བྱེད་པའོ། །
en: Rather than leading to the hearers’ attainment of fruition, it brings one closer to ultimate fruition—the seat of awakening.

source: དེའི་ཕྱིར་ཉན་ཐོས་ཀྱི་སྐྱོན་མེད་པ་ནི་ཚད་དུ་བྱ་བའོ། །བྱང་ཆུབ་སེམས་དཔའི་ནི་ཚད་དུ་བྱ་བ་མ་ཡིན་པའོ། །
en: Therefore, the flawlessness of hearers is limited, while the flawlessness of bodhisattvas is unlimited.

source: ཀླུའི་བདག་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་སྐྱེས་བུ་གཉིས་ཤིག་གཡང་ས་ཆེན་པོར་ལྟུང་བ་ལས་དེ་ལ་སྐྱེས་བུ་གཅིག་ནི་འདི་འདྲ་བའི་སྟོབས་དང་།
en: “Lord of nāgas, imagine two persons who have fallen into a deep crevasse.

source: བརྩོན་འགྲུས་དང་། བརྟུལ་བ་དང་། ཐབས་དང་།
en: One of them is strong, diligent, courageous, skilled, well prepared, and clever.

source: སྔོན་གྱི་སྦྱོར་བ་དང་། རིགས་པ་དང་ལྡན་པར་གྱུར་པ་ཞིག་པས་ལྟུང་ཡང་བརྩོན་འགྲུས་ཆེན་པོའི་སྟོབས་ཀྱིས་གཡང་ས་ཆེན་པོ་དེ་ནས་དྲངས་ནས་སླར་གཡང་ས་ཆེན་པོ་དེའི་ཁར་ཕྱིན་ཏེ་གནས་སོ། །ཅིག་ཤོས་ནི་སྟོབས་བསྐྱེད་པ་ཆུང་ལ་ཐབས་ལ་མི་མཁས་པས་ལྟུང་བ་དེ་བཞིན་དུ།
en: After he has fallen there, he manages to pull himself out of that crevasse through his own great effort, while the other person, who is weaker and unskilled, remains stuck at the bottom.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཤེས་རབ་ཀྱི་སྟོབས་བསྐྱེད་པས་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པར་རྣམ་པར་ལྟ་ཞིང་ཉེ་བར་རྟོག་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་དམིགས་པའི་སྙིང་རྗེ་ཆེན་པོས་ཡང་དག་པར་བཏང་བའི་ཐབས་ལ་མཁས་པས་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ལ་གནས་སོ། །
en: Similarly, lord of nāgas, bodhisattvas, through the power of their insight, see and realize that all phenomena are empty, signless, wishless, and unfabricated, and having perfected skillful means through their great compassion toward all beings, they abide in the mind of omniscience, while those who follow the vehicle of the hearers achieve their result by means of the intellectual analysis of phenomena.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ཅན་ནི་ཆོས་ལ་སོ་སོར་བརྟགས་ནས་འབྲས་བུ་མངོན་དུ་བྱེད་དོ། །ཀླུའི་བདག་པོ་གཡང་ས་ཆེན་པོ་ཞེས་བྱ་བ་དེ་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་ཀྱི་ཚིག་བླ་དགས་སོ། །བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་ལྡན་པའི་སྐྱེས་བུ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་བླ་དགས་སོ། །གཡང་དུ་ལྷུང་ནས་སླར་བཟློག་མ་ནུས་པ་ཞེས་བྱ་བ་དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཅན་གྱི་ཚིག་བླ་དགས་སོ། །
en: Lord of nāgas, in that analogy, the deep crevasse represents uncompounded phenomena, the diligent person represents a bodhisattva, and the person who is unable to climb out of that crevasse into which he has fallen represents a follower of the vehicle of hearers.

source: ཀླུའི་བདག་པོ་གང་དག་སྐྱོན་མེད་པ་འདི་ཐོས་པ་དེ་དག་ནི་ངེས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འབྱུང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་དང་ཡང་ཉེ་བར་འགྱུར་རོ། །
en: Lord of nāgas, those who hear about this flawlessness will certainly proceed to unsurpassed, perfect awakening and will approach the flawlessness of bodhisattvas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོའི་བུ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཟང་ཟིང་མ་མཆིས་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རིང་དུ་གནས་པར་བགྱི་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་།
en: Then the nāga prince Vikurvāṇa said to the Blessed One, “Blessed One, with a disinterested mind, I will develop the mind of awakening, to ensure that this Dharma teaching remains for a long time, and to maintain the sacred Dharma.

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: I go for refuge in the Buddha, the Dharma, and the Saṅgha.

source: བདག་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱིས་སེམས་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དང་། བྱང་ཆུབ་ཀྱི་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མངོན་པར་ཡང་དག་པར་ཁོང་དུ་ཆུད་པར་བགྱིས་ཏེ་རབ་ཏུ་བཤད་པར་བགྱིའོ། །
en: Due to the wisdom of the Buddha, I have now properly understood the nature of awakening through the nature of the mind, and the nature of all phenomena through the nature of awakening.

source: བཅོམ་ལྡན་འདས་གང་དག་རྣམ་པར་དག་པའི་ལམ་གྱི་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་མི་ཉན་པ་དེ་དག་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ལགས་སོ། །
en: I will now explain this. Blessed One, those who do not listen to this teaching on the Dharma gateway of the pure path have fallen under the sway of Māra.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ངེས་པར་འབྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འབྱུང་བའི་ལམ་ཐམས་ཅད་དུ་ངེས་པར་འབྱུང་བ་ལགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, bodhisattvas who are skilled in this Dharma teaching are skilled in all paths that lead to emancipation.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་རྣམ་པར་འཕྲུལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་གང་སེམས་ཀྱི་རང་བཞིན་གྱིས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞེས་བྱ་བ་དེ་ལ་སེམས་ཀྱི་རང་བཞིན་དེ་གང་ཡིན། སྨྲས་པ།
en: Then Venerable Subhūti asked the nāga prince Vikurvāṇa, “Noble son, when you spoke of awakening to perfect buddhahood by realizing the nature of the mind, what did you mean by the nature of the mind?”

source: བཙུན་པ་རབ་འབྱོར་གྱི་རང་བཞིན་གང་ཡིན་པའི་རང་བཞིན་དེ་སེམས་ཀྱི་རང་བཞིན་ནོ། །སྨྲས་པ།
en: “The nature of the mind is the nature of Revered Subhūti.”

source: རབ་འབྱོར་གྱི་རང་བཞིན་ཇི་ལྟ་བུ། སྨྲས་པ།
en: “What is the nature of Subhūti?”

source: གང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་རང་བཞིན་ནོ། །སྨྲས་པ།
en: “It is the nature of desire, aversion, and delusion.”

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་རང་བཞིན་ཇི་ལྟ་བུ། སྨྲས་པ།
en: “What is the nature of desire, aversion, and delusion?”

source: རྟོག་པ་དང་། རྣམ་པར་རྟོག་པའི་རང་བཞིན་ནོ། །
en: “It is the nature of concepts and thoughts.

source: རབ་འབྱོར་འདི་ལ་ཇི་སྙམ་དུ་སེམས།
en: What do you think, Subhūti?

source: རྟོག་པ་མེད་ན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྐྱེ་བར་འགྱུར་རམ། སྨྲས་པ།
en: Without thoughts, would desire, aversion, and delusion arise?”

source: དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: “No.”

source: གང་མི་རྟོག་ཅིང་རྣམ་པར་མི་རྟོག་པ་དེ་མི་སྐྱེ་བའོ། །གང་མི་སྐྱེ་བ་དེ་རང་བཞིན་ཏེ།
en: “That which is beyond concepts and thoughts does not arise, and that which does not arise is of that nature.

source: འདི་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཀྱི་རང་བཞིན་ནོ། །
en: This is the nature of desire, aversion, and delusion.

source: བཙུན་པ་རབ་འབྱོར་གྱིས་སེམས་ཀྱི་རང་བཞིན་ཞེས་བྱ་བ་དེ་གང་ཡིན་ཞེས་སྨྲས་པ་ལ་འོད་གསལ་བ་དེ་ནི་སེམས་ཀྱི་རང་བཞིན་ནོ། །
en: Revered Subhūti, you asked what it is that we call the nature of the mind.

source: གང་སེམས་ཀྱི་འོད་གསལ་བ་དེ་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་མེད་དོ། །
en: Luminosity is the nature of the mind, and the luminosity of the mind is beyond desire, aversion, and delusion.”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཉོན་མོངས་པ་གང་དག་སྐྱེ་བ་དེ་དག་སྐྱེ་བ་ན་གང་ལས་སྐྱེ།
en: “Noble son, when afflictions arise, where do they arise from?”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་ཕྱིན་ཅི་ལོག་ལས་ཉོན་མོངས་པ་རྣམས་སྐྱེ་མོད་ཀྱི །སེམས་ཀྱི་རང་བཞིན་ནི་ནམ་ཡང་ཀུན་ནས་ཉོན་མོངས་པ་མ་ཡིན་ནོ། །
en: “Revered Subhūti, afflictions arise based on wrong views, but the nature of the mind is never afflicted in any way.

source: བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་སེམས་ཀྱི་རང་བཞིན་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་ཡིན་དུ་ཟིན་ན་ནི་གང་ཡང་ཤིན་ཏུ་རྣམ་པར་དག་པར་མི་འགྱུར་བ་ཞིག་ན།
en: Revered Subhūti, if the nature of the mind were inherently afflicted, it could never be purified.

source: གང་གི་ཕྱིར་སེམས་ཀྱི་རང་བཞིན་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པ་དེའི་ཕྱིར་ཉོན་མོངས་པ་ཡོངས་སུ་ཤེས་པས་རྣམ་པར་དག་པ་ཞེས་བྱའོ། །
en: Therefore the nature of the mind is not afflicted, since as it is said, ‘when afflictions are thoroughly understood, they will be purified.’ ”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་ཉོན་མོངས་པ་རྣམས་ཡོངས་སུ་ཤེས་པ་གང་ཡིན། སྨྲས་པ།
en: Subhūti then asked, “Noble son, how are afflictions thoroughly understood?”

source: བཙུན་པ་རབ་འབྱོར་རྐྱེན་ཡོད་པར་གྱུར་ན་སྐྱེའི་རྐྱེན་མེད་ན་མི་སྐྱེ་བར་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ནི་ཉོན་མོངས་པ་རྣམས་ཡོངས་སུ་ཤེས་པའོ། །སྨྲས་པ།
en: “Revered Subhūti, to thoroughly understand the afflictions is to correctly comprehend that things arise based on conditions and that when conditions are not there, they do not arise.”

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་ལ་རབ་ཏུ་བརྩོན་པ་ཡིན། སྨྲས་པ།
en: “Noble son, how is a bodhisattva to be properly diligent?”

source: བཙུན་པ་རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱོར་བ་ཐམས་ཅད་དང་མི་ལྡན་པར་གནས་པ་དེའི་ཚེ་ཚུལ་བཞིན་ལ་བརྩོན་པ་ཡིན་ནོ། །
en: “Revered Subhūti, when a bodhisattva rests without engaging with anything they are properly diligent.
